/**
  *******************************************************************************************************
  * File Name: app_led.c
  * Author: Vector
  * Version: V1.0.0
  * Date: 2018-7-4
  * Brief: LED应用层
  *******************************************************************************************************
  * History
  *		1.Author: Vector
	*			Date: 2018-7-4
	*			Mod: 建立本文件
  *
  *******************************************************************************************************
  */	
/*
    *******************************************************************************************************
    *                              INCLUDE FILES
    *******************************************************************************************************
  */	
# include "app.h"
# include "gui_key.h"
/*
  *******************************************************************************************************
  *                              LOCAL VARIABLE
  *******************************************************************************************************
*/
TaskHandle_t ledTaskHandle = NULL;
void task_LEDTask(void *p_arg);


/*
*********************************************************************************************************
*                      task_LEDTask                    
*
* Description: LED线程任务
*             
* Arguments  : None.
*
* Reutrn     : None.
*
* Note(s)    : None.
*********************************************************************************************************
*/
void task_LEDTask(void *p_arg)
{
	TickType_t xLastWakeTime;
	const TickType_t xPeriod = 5;
	
	/*  先获取一次系统时间,因为调用的是绝对延迟  */
	xLastWakeTime = xTaskGetTickCount();
	bsp_led_StartFlash(LED_ALL, 5, 50, LED_KEEP_FLASH);
	
	while(1)
	{
		bsp_led_Thread();
		bsp_key_Scan();
		gui_inputKey(bsp_key_GetKey());
		
//		if(bsp_key_GetKey() == KEY_PWR_LONG)
//		{
//			bsp_led_Toggle(LED_RED);
//			bsp_led_Toggle(LED_BLUE);
//			power_Enabled(false);
//		}
		vTaskDelayUntil(&xLastWakeTime, xPeriod);
	}
}
/********************************************  END OF FILE  *******************************************/

